{"loss": "categorical_crossentropy", "optimizer": {"epsilon": 1e-08, "lr": 0.0010000000474974513, "name": "RMSprop", "rho": 0.8999999761581421}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "batch_input_shape": [null, 3, 30, 30], "trainable": true, "name": "zeropadding2d_6", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_41", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 15, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_42", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 15, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_21", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_43", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_44", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_22", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_45", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_46", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_23", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_47", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_48", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 2}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_24", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_21", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 100}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_16"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_22", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 100}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_17"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_23", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_18"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_24", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 4}}], "sample_weight_mode": null}